tmp/wsl_bench_fast/arc_run1.txt
Running 8s test @ http://127.0.0.1:8080/x
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.94ms    5.81ms  63.39ms   70.34%
    Req/Sec     5.98k   715.78     8.14k    78.91%
  Latency Distribution
     50%   10.31ms
     75%   14.19ms
     90%   18.41ms
     99%   28.06ms
  382865 requests in 8.06s, 54.77MB read
Requests/sec:  47474.66
Transfer/sec:      6.79MB