tmp/wsl_bench_fast/arc_run2.txt
Running 8s test @ http://127.0.0.1:8080/x
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.64ms    5.46ms  52.62ms   69.36%
    Req/Sec     6.12k     0.87k   23.73k    92.97%
  Latency Distribution
     50%   10.11ms
     75%   13.83ms
     90%   17.72ms
     99%   26.46ms
  391954 requests in 8.09s, 56.07MB read
Requests/sec:  48446.58
Transfer/sec:      6.93MB