tmp/wsl_bench_fast/arc_run3.txt
Running 8s test @ http://127.0.0.1:8080/x
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.65ms    5.41ms  47.67ms   68.87%
    Req/Sec     6.10k     0.91k   25.60k    93.75%
  Latency Distribution
     50%   10.17ms
     75%   13.89ms
     90%   17.72ms
     99%   25.88ms
  390277 requests in 8.09s, 55.83MB read
Requests/sec:  48229.04
Transfer/sec:      6.90MB