tmp/wsl_bench_fast/backend_run1.txt
Running 8s test @ http://127.0.0.1:3000/x
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.18ms    1.65ms  37.35ms   73.35%
    Req/Sec    31.21k     4.59k   55.95k    78.91%
  Latency Distribution
     50%    2.04ms
     75%    2.75ms
     90%    4.12ms
     99%    7.64ms
  1993378 requests in 8.06s, 285.15MB read
Requests/sec: 247356.77
Transfer/sec:     35.38MB