tmp/wsl_bench_fast/backend_run2.txt
Running 8s test @ http://127.0.0.1:3000/x
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.18ms    1.69ms  25.23ms   70.18%
    Req/Sec    31.47k     9.23k   95.48k    75.78%
  Latency Distribution
     50%    1.99ms
     75%    2.97ms
     90%    4.30ms
     99%    7.64ms
  2011010 requests in 8.08s, 287.67MB read
Requests/sec: 249013.95
Transfer/sec:     35.62MB