tmp/wsl_bench_fast/backend_run3.txt
Running 8s test @ http://127.0.0.1:3000/x
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.21ms    1.71ms  43.22ms   73.97%
    Req/Sec    31.10k     4.81k   57.02k    76.25%
  Latency Distribution
     50%    2.02ms
     75%    2.86ms
     90%    4.27ms
     99%    7.79ms
  1985866 requests in 8.05s, 284.07MB read
Requests/sec: 246641.33
Transfer/sec:     35.28MB