tmp/wsl_bench_fast/nginx_run1.txt
Running 8s test @ http://127.0.0.1:8081/x
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.76ms    2.51ms  31.21ms   74.72%
    Req/Sec    11.24k     1.96k   23.73k    75.00%
  Latency Distribution
     50%    5.48ms
     75%    7.06ms
     90%    8.82ms
     99%   13.32ms
  717619 requests in 8.05s, 102.65MB read
Requests/sec:  89120.66
Transfer/sec:     12.75MB