tmp/wsl_bench_fast/nginx_run2.txt
Running 8s test @ http://127.0.0.1:8081/x
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.81ms    2.54ms  32.53ms   74.70%
    Req/Sec    11.13k     1.73k   23.21k    71.72%
  Latency Distribution
     50%    5.61ms
     75%    7.16ms
     90%    8.84ms
     99%   13.15ms
  710535 requests in 8.04s, 101.64MB read
Requests/sec:  88413.83
Transfer/sec:     12.65MB