tmp/wsl_bench_fast/nginx_run3.txt
Running 8s test @ http://127.0.0.1:8081/x
  8 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.76ms    2.22ms  28.44ms   75.55%
    Req/Sec    11.20k     1.51k   37.25k    87.50%
  Latency Distribution
     50%    5.63ms
     75%    6.90ms
     90%    8.35ms
     99%   11.99ms
  714185 requests in 8.06s, 102.16MB read
Requests/sec:  88651.72
Transfer/sec:     12.68MB